{
  "backend/main.mo": "Motoko canister defining types and storage for experiences, users, friendships, messages, and exposing query functions for retrieving experiences.",
  "feature_evidence.json": "Feature evidence report mapping features to affected frontend files, components, and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries of numerous frontend files describing their roles in routing, UI layout, auth, and experience features.",
  "frontend/index.css": "Tailwind base styles defining OKLCH color variables for light and dark themes and applying global background/text rules.",
  "frontend/index.html": "HTML entry point mounting the React app and loading main.tsx with favicon and metadata.",
  "frontend/src/App.tsx": "Sets up TanStack Router routes and wraps the app with ThemeProvider and Toaster.",
  "frontend/src/components/auth/AccountsDisabledNotice.tsx": "Card component prompting users to log in or sign up when access is restricted.",
  "frontend/src/components/auth/AuthButtons.tsx": "Renders login/signup or logout buttons based on session auth state.",
  "frontend/src/components/auth/RequireProfile.tsx": "Auth guard that fetches user data when logged in and shows login/signup prompt otherwise.",
  "frontend/src/components/experiences/CreatorFollowButton.tsx": "Button to follow or unfollow a creator using social-following hooks with authentication checks and toasts.",
  "frontend/src/components/experiences/ExperienceCard.tsx": "Displays an experience card with thumbnail, title, description, creator info, and navigation to the experience page.",
  "frontend/src/components/experiences/ExperienceGrid.tsx": "Renders a grid of experience cards with loading skeletons and an empty-state message.",
  "frontend/src/components/experiences/ExperienceRatingControls.tsx": "Provides thumbs-up/down rating buttons with authentication checks and rating mutations.",
  "frontend/src/components/experiences/InGameMenu.tsx": "Implements an in-game menu allowing players to leave, reset character, or open settings via dialogs.",
  "frontend/src/components/experiences/PublishExperienceDialog.tsx": "Dialog for creating and publishing a new experience, including fields, thumbnail upload, and submission handling.",
  "frontend/src/components/layout/AppLayout.tsx": "Defines the main app layout with header, footer, sidebar, and routed content area.",
  "frontend/src/components/layout/AuthChangeBanner.tsx": "Shows a banner notifying users about authentication changes and restrictions.",
  "frontend/src/components/layout/LeftSidebar.tsx": "Provides a sidebar navigation menu with links to profile, social, inventory, groups, and settings.",
  "frontend/src/components/layout/SiteFooter.tsx": "Renders the site footer with copyright info and a link attribution to caffeine.ai.",
  "frontend/src/components/layout/SiteHeader.tsx": "Displays the site header with logo, navigation links, auth buttons, and mobile menu handling.",
  "frontend/src/components/profile/ProfileHeaderCard.tsx": "Shows a user's profile header with avatar, display name, and quick navigation buttons.",
  "frontend/src/components/social/FollowingPanel.tsx": "Renders a panel listing followed creators, supports unfollowing, and displays loading skeletons or empty state.",
  "frontend/src/components/social/FriendsPanel.tsx": "Provides friend search, friend requests, pending request handling, and unfriend actions with loading states.",
  "frontend/src/components/social/MessagesPanel.tsx": "Implements user search, selecting a recipient, viewing messages, and sending direct messages.",
  "frontend/src/components/social/PartiesPanel.tsx": "Static placeholder panel announcing a future party system feature.",
  "frontend/src/hooks/useActor.ts": "Creates and caches the backend actor based on the user’s identity and invalidates related queries when it changes.",
  "frontend/src/hooks/useCurrentUser.ts": "Light wrapper exposing current user session state from useSessionAuth.",
  "frontend/src/hooks/useExperiences.ts": "React Query hooks for fetching and searching experiences via the backend actor, plus placeholders for create and rate mutations.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context, including login, logout, identity loading, and status handling.",
  "frontend/src/hooks/useQueries.ts": "Provides React Query hooks for user profiles and experience data, with many backend methods still unimplemented.",
  "frontend/src/hooks/useSessionAuth.ts": "Implements session-based auth state with temporary mock login and signup until backend support exists.",
  "frontend/src/hooks/useSocialFollowing.ts": "Placeholder hooks for following creators, all returning static data or throwing errors due to missing backend.",
  "frontend/src/hooks/useSocialFriends.ts": "Defines friend list, requests, and mutation hooks, all stubbed pending backend implementation.",
  "frontend/src/hooks/useSocialMessages.ts": "Provides message fetching and sending hooks with placeholder behavior awaiting backend support.",
  "frontend/src/hooks/useSocialParties.ts": "Stub hook for retrieving the current party, disabled until backend features are added.",
  "frontend/src/hooks/useUserDiscovery.ts": "Implements disabled user search returning empty results until backend session-based search exists.",
  "frontend/src/hooks/useUserProfile.ts": "Provides profile fetching and signup hooks, all disabled or throwing due to missing backend.",
  "frontend/src/index.css": "Sets global Tailwind styles and custom CSS variables for light and dark themes.",
  "frontend/src/main.tsx": "Application entry point initializing React Query and Internet Identity provider before rendering App.",
  "frontend/src/pages/AvatarShop.tsx": "UI page showing categories and a coming-soon notice for the Avatar Shop.",
  "frontend/src/pages/Create.tsx": "Renders the Create page with feature cards and authentication gating for creation tools.",
  "frontend/src/pages/DiniBucks.tsx": "Displays Dini Bucks info, balance (if authenticated), and feature cards for earning and spending.",
  "frontend/src/pages/Discover.tsx": "Provides search, trending listings, category browsing, and experience publishing for authenticated users.",
  "frontend/src/pages/ExperienceDetails.tsx": "Shows details for a single experience with play handling, creator info, and rating controls.",
  "frontend/src/pages/Groups.tsx": "Displays the Groups page with a placeholder indicating no joined groups.",
  "frontend/src/pages/Home.tsx": "Renders the home page with recommended experiences, user greeting, and friend activity section.",
  "frontend/src/pages/Inventory.tsx": "Shows the user’s inventory page with an empty-state message for items.",
  "frontend/src/pages/Login.tsx": "Implements a login form with validation, error handling, and redirects on successful authentication.",
  "frontend/src/pages/Profile.tsx": "Displays the authenticated user's profile details and account info behind a profile-required wrapper.",
  "frontend/src/pages/Settings.tsx": "Renders a placeholder settings page with account settings UI structure.",
  "frontend/src/pages/SignUp.tsx": "Provides a signup form with field validation, error handling, and redirects after account creation.",
  "frontend/src/pages/Social.tsx": "Shows a tabbed social interface for friends, messages, parties, and following, requiring authentication.",
  "frontend/src/utils/sessionToken.ts": "Manages storing, retrieving, and clearing session tokens in localStorage.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading, persisting, and clearing URL parameters using URLSearchParams and sessionStorage.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending theme colors, animations, and plugins for the frontend UI.",
  "project_state.json": "Defines the project's current state, including schema version, existing features, pending feature requests, and metadata for planning. Lists authentication-related upgrades and backend session feature requests."
}