{
  "backend/main.mo": "Main backend canister defining user settings, public profiles, and experience data with queries for searching, filtering, and trending experiences.",
  "backend/migration.mo": "Migration module copying userProfiles and userSettings from an old actor state while dropping deprecated data.",
  "feature_evidence.json": "Feature evidence report listing feature metadata, affected frontend files, components, and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of various frontend files and components.",
  "frontend/index.css": "Global Tailwind CSS variables and theme definitions for light and dark modes using OKLCH color values.",
  "frontend/index.html": "Base HTML page bootstrapping the frontend with root div and main script entry.",
  "frontend/src/App.tsx": "Application root configuring TanStack Router routes and wrapping the app in ThemeProvider and Toaster.",
  "frontend/src/components/auth/AccountsDisabledNotice.tsx": "UI card prompting users to log in or sign up when accessing disabled or restricted features.",
  "frontend/src/components/auth/AuthButtons.tsx": "Authentication button group showing login/signup or logout depending on session state.",
  "frontend/src/components/auth/RequireProfile.tsx": "Guard component requiring authentication and showing a login/signup prompt when unauthenticated.",
  "frontend/src/components/create/builder2d/BuilderCanvas.tsx": "Canvas component enabling element selection, dragging, and resizing with mouse event listeners tied to builder state updates.",
  "frontend/src/components/create/builder2d/DecalUploader.tsx": "Provides an image file picker that reads images as data URLs and adds them as decals via the builder.",
  "frontend/src/components/create/builder2d/LayerControls.tsx": "Controls for moving the selected element forward/backward in layer order or deleting it.",
  "frontend/src/components/create/builder2d/PropertiesPanel.tsx": "Panel for adjusting position, opacity, rotation, color, and size of the currently selected element.",
  "frontend/src/components/create/builder2d/PropsPanel.tsx": "Manages saving, loading, exporting, importing, and deleting saved prop configurations for the 2D builder.",
  "frontend/src/components/create/builder2d/ShapePalette.tsx": "Buttons to add rectangle, circle, or triangle shapes to the builder canvas.",
  "frontend/src/components/experiences/CreatorFollowButton.tsx": "Button to follow or unfollow a creator with authentication and self-follow checks.",
  "frontend/src/components/experiences/ExperienceCard.tsx": "Displays an experience thumbnail, title, description, and creator info with navigation to its detail page.",
  "frontend/src/components/experiences/ExperienceGrid.tsx": "Renders a grid of experience cards with loading skeletons and empty-state handling.",
  "frontend/src/components/experiences/ExperienceRatingControls.tsx": "Thumbs-up and thumbs-down rating buttons for an experience with authentication checks.",
  "frontend/src/components/experiences/InGameMenu.tsx": "Provides an in‑game menu with options to leave, reset the character, and open settings using dialogs and alerts.",
  "frontend/src/components/experiences/PublishExperienceDialog.tsx": "Dialog form for publishing an experience, including title, description, category, controls, and optional thumbnail upload with progress.",
  "frontend/src/components/layout/AppLayout.tsx": "Defines the main app layout with header, footer, sidebar, and routed content area.",
  "frontend/src/components/layout/AuthChangeBanner.tsx": "Displays a banner announcing updated authentication behavior and restrictions.",
  "frontend/src/components/layout/LeftSidebar.tsx": "Renders the left navigation sidebar with links to core user sections.",
  "frontend/src/components/layout/SiteFooter.tsx": "Footer showing copyright info and a caffeine.ai attribution link.",
  "frontend/src/components/layout/SiteHeader.tsx": "Site header with navigation, logo, auth buttons, and a responsive mobile menu.",
  "frontend/src/components/profile/ProfileHeaderCard.tsx": "Shows a user's profile header with avatar, display name, and quick navigation buttons.",
  "frontend/src/components/social/FollowingPanel.tsx": "Lists followed creators with options to unfollow and loads creator details dynamically.",
  "frontend/src/components/social/FriendsPanel.tsx": "UI panel for searching users, managing friends, and handling friend requests using social hooks and identity.",
  "frontend/src/components/social/MessagesPanel.tsx": "Messaging UI allowing user search, conversation selection, and sending messages with associated hooks.",
  "frontend/src/components/social/PartiesPanel.tsx": "Placeholder UI card announcing an upcoming party/group system feature.",
  "frontend/src/hooks/useAccountSettings.ts": "React Query hooks for fetching and updating user account settings such as display name, avatar, and visibility.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the user's identity, refetching dependent queries on changes.",
  "frontend/src/hooks/useBuilder2D.ts": "Manages 2D builder state including elements, selection, transformations, layering, and canvas reset/load.",
  "frontend/src/hooks/useBuilder2DProps.ts": "Handles saving, loading, exporting, and importing builder props via localStorage.",
  "frontend/src/hooks/useCurrentUser.ts": "Thin wrapper exposing current user and auth state from session auth.",
  "frontend/src/hooks/useExperiences.ts": "Provides React Query hooks for fetching and mutating experience data via the actor, with several backend methods still unimplemented.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements an Internet Identity context and provider for managing identities, login, and initialization using AuthClient.",
  "frontend/src/hooks/useQueries.ts": "Contains generic React Query hooks for user profiles and experiences, many of which rely on placeholder or unimplemented backend methods.",
  "frontend/src/hooks/useSessionAuth.ts": "Implements session-token-based auth flows with mock backend interactions, handling login, signup, and session validation.",
  "frontend/src/hooks/useSocialFollowing.ts": "Defines placeholder hooks for following creators, all currently disabled or throwing errors due to missing backend support.",
  "frontend/src/hooks/useSocialFriends.ts": "Provides friend list and request management hooks using React Query, with all backend interactions still unimplemented.",
  "frontend/src/hooks/useSocialMessages.ts": "Offers messaging hooks for sending and fetching messages, but all calls return empty results or errors until backend support exists.",
  "frontend/src/hooks/useSocialParties.ts": "Contains a placeholder hook for retrieving the current party, disabled pending backend implementation.",
  "frontend/src/hooks/useUserDiscovery.ts": "Implements a disabled user search hook returning empty results until backend session-based search is available.",
  "frontend/src/hooks/useUserProfile.ts": "Provides React Query hooks for fetching and mutating user profile data, currently returning placeholders until backend session auth is implemented.",
  "frontend/src/index.css": "Defines global Tailwind setup and CSS variables for theming, including light/dark modes and base typography styles.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClient and InternetIdentity providers and loads global styles.",
  "frontend/src/pages/AvatarShop.tsx": "Renders a placeholder Avatar Shop page with category cards and a coming-soon message.",
  "frontend/src/pages/Create.tsx": "Displays creation options and navigation cards for building games or UGC accessories.",
  "frontend/src/pages/CreateGamesBuilder2D.tsx": "Implements the 2D game builder layout with canvas, shape tools, layers, properties, and props panels.",
  "frontend/src/pages/CreateUGCAccessories.tsx": "Shows a coming-soon page for the UGC accessories creator with a back button and description.",
  "frontend/src/pages/DiniBucks.tsx": "Displays Dini Bucks info, balance access gated by authentication, and feature cards for earn/spend/trade/premium.",
  "frontend/src/pages/Discover.tsx": "A discovery page that supports searching, browsing by category, viewing trending experiences, and opening a publish dialog if authenticated.",
  "frontend/src/pages/ExperienceDetails.tsx": "Displays detailed information for a single experience, including creator info, controls, and a play simulation with authentication checks.",
  "frontend/src/pages/Groups.tsx": "Shows a groups landing page with a placeholder card indicating the user has not joined any groups yet.",
  "frontend/src/pages/Home.tsx": "Home dashboard featuring recommended experiences, user welcome card, and friend activity section.",
  "frontend/src/pages/Inventory.tsx": "Inventory page showing a placeholder card when the user has no items.",
  "frontend/src/pages/Login.tsx": "Login form handling username/password authentication with validation and error display.",
  "frontend/src/pages/Profile.tsx": "Profile page displaying user info, avatar, and navigation to edit profile or settings, wrapped in profile requirement logic.",
  "frontend/src/pages/Settings.tsx": "React settings page that loads user settings, allows updating profile data, avatar, visibility, and handles error/loading states with various mutations.",
  "frontend/src/pages/SignUp.tsx": "User signup form handling validation, account creation, and navigation after successful registration.",
  "frontend/src/pages/Social.tsx": "Authenticated social hub page with tabbed panels for friends, messages, parties, and following.",
  "frontend/src/utils/formatError.ts": "Utility that converts unknown error values into readable message strings for UI display.",
  "frontend/src/utils/sessionToken.ts": "Helpers for storing, retrieving, and clearing the session token in localStorage.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading, persisting, and clearing URL parameters using query strings and sessionStorage.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining themes, colors, fonts, animations, and content paths.",
  "project_state.json": "Project metadata describing state, issues, and feature requests for backend settings fixes and improved error reporting."
}