{
  "backend/main.mo": "Defines user profiles, experiences, social data structures, and related CRUD operations with access control and storage mixins.",
  "feature_evidence.json": "Lists implemented social features with associated files, components, and test IDs for traceability.",
  "frontend-file-summaries.txt": "Provides human‑written summaries for numerous frontend files used across the app.",
  "frontend/index.css": "Defines global Tailwind styles and theme variables for light and dark modes.",
  "frontend/index.html": "Minimal HTML entry point loading the React app root and main script.",
  "frontend/src/App.tsx": "Sets up the TanStack Router routes and wraps the app with theme provider and toaster notifications.",
  "frontend/src/components/auth/AuthButtons.tsx": "Renders login, signup, and logout buttons with Internet Identity integration.",
  "frontend/src/components/auth/RequireProfile.tsx": "Route guard ensuring users are authenticated and have a profile before accessing protected pages.",
  "frontend/src/components/experiences/CreatorFollowButton.tsx": "Renders a follow/unfollow button for a creator, handling authentication, self-check, and follow state mutations.",
  "frontend/src/components/experiences/ExperienceCard.tsx": "Displays an experience card with thumbnail, title, description, and creator info, navigating to the experience page on click.",
  "frontend/src/components/experiences/ExperienceGrid.tsx": "Shows a responsive grid of ExperienceCard components with loading skeletons and empty-state messaging.",
  "frontend/src/components/experiences/ExperienceRatingControls.tsx": "Provides thumbs-up and thumbs-down rating buttons for an experience, handling authentication and rating mutations.",
  "frontend/src/components/experiences/InGameMenu.tsx": "Implements an in-game menu with leave, reset character, and settings dialogs using multiple modal components.",
  "frontend/src/components/experiences/PublishExperienceDialog.tsx": "Dialog form for publishing a new experience, including fields, thumbnail upload with preview/progress, and submit handling.",
  "frontend/src/components/layout/AppLayout.tsx": "Defines the main app layout with header, sidebar, routed content outlet, and footer.",
  "frontend/src/components/layout/LeftSidebar.tsx": "Sidebar navigation listing links to profile, social, inventory, groups, and settings.",
  "frontend/src/components/layout/SiteFooter.tsx": "Footer displaying copyright text and a referral link to caffeine.ai.",
  "frontend/src/components/layout/SiteHeader.tsx": "Top navigation bar with logo, desktop links, auth buttons, and a toggleable mobile menu.",
  "frontend/src/components/profile/ProfileHeaderCard.tsx": "Renders a user profile header card with avatar, name, and navigation buttons, showing loading or nothing when appropriate.",
  "frontend/src/components/social/FollowingPanel.tsx": "Displays followed creators with loading states and allows unfollowing via mutations and profile lookups.",
  "frontend/src/components/social/FriendsPanel.tsx": "Provides friend search, friend requests, pending request handling, and friend list management with related actions.",
  "frontend/src/components/social/MessagesPanel.tsx": "Implements a messaging UI allowing user search, selecting recipients, viewing messages, and sending new messages.",
  "frontend/src/components/social/PartiesPanel.tsx": "Shows a placeholder panel for a future party system feature.",
  "frontend/src/hooks/useActor.ts": "Creates and caches an authenticated or anonymous backend actor, refreshing dependent queries when identity changes.",
  "frontend/src/hooks/useCurrentUser.ts": "Returns authentication state, principal, and user role by querying the backend actor.",
  "frontend/src/hooks/useExperiences.ts": "Provides queries and mutations for fetching, searching, creating, and rating experiences using the backend actor.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for Internet Identity authentication, handling login, stored identity loading, and status tracking.",
  "frontend/src/hooks/useSocialFollowing.ts": "Defines placeholder React Query hooks for following creators, with backend calls unimplemented and disabled.",
  "frontend/src/hooks/useSocialFriends.ts": "Implements friend list, friend requests, and friend request actions using actor methods and React Query.",
  "frontend/src/hooks/useSocialMessages.ts": "Provides message retrieval and sending hooks backed by actor methods and cache invalidation.",
  "frontend/src/hooks/useSocialParties.ts": "Contains a placeholder hook for party data retrieval with backend functionality not yet implemented.",
  "frontend/src/hooks/useUserDiscovery.ts": "Adds a search hook that queries users by display name through the actor when a term is provided.",
  "frontend/src/hooks/useUserProfile.ts": "Implements hooks for fetching and updating user profiles, including signup and profile lookup by principal.",
  "frontend/src/index.css": "Defines Tailwind base styles, CSS variables for themes, and global typography and layout rules.",
  "frontend/src/main.tsx": "Sets up the React app root with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/AvatarShop.tsx": "Renders a UI page for an avatar shop with category cards and a coming-soon message.",
  "frontend/src/pages/Create.tsx": "Displays the creation tools overview page with gated login prompt and info cards for upcoming features.",
  "frontend/src/pages/DiniBucks.tsx": "Displays Dini Bucks info, showing balance or login prompt and feature cards describing earning and spending.",
  "frontend/src/pages/Discover.tsx": "Experience discovery page with search, trending by category, and publishing option for authenticated users.",
  "frontend/src/pages/ExperienceDetails.tsx": "Shows full details for an experience with play simulation, creator info, controls, and navigation.",
  "frontend/src/pages/Groups.tsx": "Static groups page displaying a placeholder when the user has not joined any groups.",
  "frontend/src/pages/Home.tsx": "Home dashboard showing welcome card, recommended experiences, and friend activity placeholder.",
  "frontend/src/pages/Inventory.tsx": "Inventory page showing empty-state messaging for user items and collectibles.",
  "frontend/src/pages/Profile.tsx": "User profile page showing profile header and experiences authored by the logged‑in user.",
  "frontend/src/pages/Settings.tsx": "Settings page with placeholder content for account configuration options.",
  "frontend/src/pages/SignUp.tsx": "Sign-up page that handles Internet Identity login, profile creation, avatar upload with progress, and redirects if a profile already exists.",
  "frontend/src/pages/Social.tsx": "Social hub page showing friends, messages, parties, and following tabs, with authentication gating and navigation options.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, storing, and clearing URL and session parameters, supporting both query and hash-based routing.",
  "frontend/tailwind.config.js": "Tailwind configuration extending theme colors, animations, and layout settings, and enabling typography, container queries, and animations plugins.",
  "project_state.json": "Project metadata describing existing social features, pending backend feature requests, and current project state version."
}