{
  "backend/main.mo": "Main canister logic defining user profiles, experience records with categories and stats, access control, and CRUD-style methods for signup and experience creation.",
  "backend/migration.mo": "Migration utility that upgrades old experience records by adding category, stats fields, and gameplay controls while preserving existing data.",
  "feature_evidence.json": "Evidence report mapping features to affected frontend files, components, and test IDs for build traceability.",
  "frontend-file-summaries.txt": "Prewritten list of short summaries for many frontend files used across the project.",
  "frontend/index.css": "Global Tailwind-based theme configuration defining color variables, dark mode values, and base styling.",
  "frontend/index.html": "HTML entry point that sets up the root element and loads the main TypeScript bundle.",
  "frontend/src/App.tsx": "Router configuration defining all application routes and wrapping the app with theme and toast providers.",
  "frontend/src/components/auth/AuthButtons.tsx": "Authentication UI with login, signup, and logout handlers based on Internet Identity state.",
  "frontend/src/components/auth/RequireProfile.tsx": "Route guard requiring authentication and a completed user profile before granting access to protected pages.",
  "frontend/src/components/experiences/ExperienceCard.tsx": "Displays an experience card with thumbnail, title, description, creator info, and navigation on click.",
  "frontend/src/components/experiences/ExperienceGrid.tsx": "Renders a grid of experience cards with loading skeletons and an empty state message.",
  "frontend/src/components/experiences/ExperienceRatingControls.tsx": "Provides thumbs-up/down rating buttons for an experience with authentication checks and mutation handling.",
  "frontend/src/components/experiences/InGameMenu.tsx": "Implements an in-game menu with leave, reset character, and settings dialogs.",
  "frontend/src/components/experiences/PublishExperienceDialog.tsx": "Form dialog for creating and publishing a new experience, including thumbnail upload and validation.",
  "frontend/src/components/layout/AppLayout.tsx": "Defines the main app layout with header, sidebar, footer, and routed content area.",
  "frontend/src/components/layout/LeftSidebar.tsx": "Renders a sidebar with navigation links and icons for profile, inventory, groups, and settings.",
  "frontend/src/components/layout/SiteFooter.tsx": "Displays the site footer with copyright text and a link to caffeine.ai.",
  "frontend/src/components/layout/SiteHeader.tsx": "Renders the main site header with logo, navigation links, auth buttons, and a mobile menu.",
  "frontend/src/components/profile/ProfileHeaderCard.tsx": "Shows a user's profile header with avatar, name, and navigation buttons, handling loading and null states.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor based on the current identity and invalidates dependent queries when it changes.",
  "frontend/src/hooks/useCurrentUser.ts": "Fetches the current user’s principal and role using the actor, exposing auth status and loading state.",
  "frontend/src/hooks/useExperiences.ts": "Provides queries and mutations for listing, searching, fetching, creating, rating, and updating experience data via the actor.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements an Internet Identity provider and hook for managing authentication, identity loading, and login state.",
  "frontend/src/hooks/useUserProfile.ts": "Queries and mutates user profile data, including fetching profiles and signing up new users through the actor.",
  "frontend/src/index.css": "Defines Tailwind base setup and CSS variables for light and dark themes with global styling.",
  "frontend/src/main.tsx": "Bootstraps the app with React, wrapping it in query and identity providers.",
  "frontend/src/pages/AvatarShop.tsx": "Renders a placeholder avatar shop page with category cards and a coming soon message.",
  "frontend/src/pages/Create.tsx": "Displays creation tool features, prompts unauthenticated users to log in, and includes a coming soon section for the studio.",
  "frontend/src/pages/DiniBucks.tsx": "Displays Dini Bucks info with login prompt or balance and showcases earning, spending, trading, and premium options.",
  "frontend/src/pages/Discover.tsx": "Provides search, trending, and category-based browsing of experiences with an option to publish when authenticated.",
  "frontend/src/pages/ExperienceDetails.tsx": "Shows detailed experience info, creator data, controls, and simulated play state with play/leave handling.",
  "frontend/src/pages/Groups.tsx": "Renders a placeholder Groups page showing that the user has not joined any groups yet.",
  "frontend/src/pages/Home.tsx": "Displays a personalized welcome, recommended experiences, and friend activity with navigation shortcuts.",
  "frontend/src/pages/Inventory.tsx": "Shows an empty inventory state encouraging users to acquire items from the Avatar Shop.",
  "frontend/src/pages/Profile.tsx": "Shows the user's profile and lists their published experiences using a protected profile wrapper.",
  "frontend/src/pages/Settings.tsx": "Presents a placeholder account settings page indicating configuration is coming soon.",
  "frontend/src/pages/SignUp.tsx": "Implements the sign‑up flow using Internet Identity, allowing users to set a display name and optional avatar upload before creating their profile.",
  "frontend/src/utils/urlParams.ts": "Provides utilities for reading URL parameters, persisting them in sessionStorage, and clearing them from the URL or session.",
  "frontend/tailwind.config.js": "Configures Tailwind CSS with custom colors, themes, animations, and plugins including typography, container queries, and animations.",
  "project_state.json": "Stores the project’s current state, requirements, features, and architectural notes for the Dini.Verse platform."
}