{
  "backend/main.mo": "Main Motoko actor implementing a game platform backend with user profiles, experiences (games), authorization mixins, blob storage, and query/update methods for managing experiences, user settings, and profiles.",
  "feature_evidence.json": "Feature evidence report documenting the replacement of a header logo image element with an uploaded image.png stored as a static asset in frontend/public/assets/.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend files including components, pages, hooks, and configuration files describing the React application structure with TanStack Router, authentication, experiences, and profile management.",
  "frontend/index.css": "Global Tailwind CSS styles with OKLCH-based design tokens for light and dark themes, including color variables for UI components, charts, sidebar, and custom properties for radius and borders.",
  "frontend/index.html": "HTML entry point for the Dini.Verse application with viewport meta tags, favicon reference, and root div mounting the React app via main.tsx.",
  "frontend/src/App.tsx": "Root React component configuring TanStack Router with all application routes (home, discover, profile, create, settings, etc.), ThemeProvider forced to light mode, and Toaster for notifications.",
  "frontend/src/components/auth/AccountsDisabledNotice.tsx": "Card component displaying a login required notice with navigation buttons to login and signup pages for unauthenticated users.",
  "frontend/src/components/auth/AuthButtons.tsx": "Authentication control buttons component showing Login/Sign Up buttons when logged out and a single Logout button when authenticated, with loading state handling.",
  "frontend/src/components/auth/RequireProfile.tsx": "Authentication guard component that wraps protected content, displaying a login prompt card with navigation buttons for unauthenticated users and loading spinner during auth checks.",
  "frontend/src/components/create/builder2d/BuilderCanvas.tsx": "Canvas component for 2D builder that handles drag-and-drop positioning and corner-based resizing of elements with mouse event handlers.",
  "frontend/src/components/create/builder2d/DecalUploader.tsx": "File upload component that allows users to select and upload image files as decals to the 2D builder.",
  "frontend/src/components/create/builder2d/LayerControls.tsx": "UI controls for managing element z-order (bring forward, send backward) and deletion of selected elements.",
  "frontend/src/components/create/builder2d/PropertiesPanel.tsx": "Panel displaying sliders and inputs to edit selected element properties including position, opacity, rotation, color, and dimensions.",
  "frontend/src/components/create/builder2d/PropsPanel.tsx": "Panel for saving, loading, importing, exporting, and deleting reusable prop compositions with dialog-based workflows.",
  "frontend/src/components/create/builder2d/ShapePalette.tsx": "Palette of buttons to add basic shapes (rectangle, circle, triangle) to the 2D builder canvas.",
  "frontend/src/components/experiences/CreatorFollowButton.tsx": "Follow/unfollow button for creators with authentication checks and self-follow prevention.",
  "frontend/src/components/experiences/ExperienceCard.tsx": "Card component displaying experience thumbnail, title, description, and creator with hover effects and navigation to detail page.",
  "frontend/src/components/experiences/ExperienceGrid.tsx": "Grid layout component that displays experience cards with loading skeletons and empty state handling.",
  "frontend/src/components/experiences/ExperienceRatingControls.tsx": "Thumbs up/down rating buttons for experiences with authentication checks and vote count display.",
  "frontend/src/components/experiences/InGameMenu.tsx": "Provides an in-game menu overlay with options to leave the game, reset character position, and access settings (placeholder). Uses dialogs and alert dialogs for confirmation flows.",
  "frontend/src/components/experiences/PublishExperienceDialog.tsx": "Dialog form for publishing new experiences with fields for title, description, category, gameplay controls, and thumbnail upload. Handles file upload with progress tracking and creates experiences via mutation hook.",
  "frontend/src/components/layout/AppLayout.tsx": "Main application layout wrapper that combines SiteHeader, LeftSidebar, SiteFooter, and renders child routes via Outlet.",
  "frontend/src/components/layout/AuthChangeBanner.tsx": "Displays an informational alert banner notifying users about on-platform authentication availability and external login restrictions.",
  "frontend/src/components/layout/LeftSidebar.tsx": "Navigation sidebar for desktop view with links to Profile, Social, Inventory, Groups, and Settings pages, each with corresponding icons.",
  "frontend/src/components/layout/SiteFooter.tsx": "Footer component displaying copyright information and a 'Built with caffeine.ai' attribution link with UTM tracking.",
  "frontend/src/components/layout/SiteHeader.tsx": "Sticky header with logo, navigation links (Home, Discover, Avatar Shop, Create, Dini Bucks), authentication buttons, and responsive mobile menu toggle.",
  "frontend/src/components/profile/ProfileHeaderCard.tsx": "Displays user profile header with avatar, display name, and action buttons to navigate to Discover or publish experiences. Handles loading and empty states.",
  "frontend/src/components/social/FollowingPanel.tsx": "Shows a list of followed creators with avatars and unfollow buttons. Fetches followed creators and individual user profiles, displaying loading skeletons and empty states.",
  "frontend/src/components/social/FriendsPanel.tsx": "React component for managing friends: search users, send/accept/decline friend requests, view friends list, and unfriend users with toast notifications.",
  "frontend/src/components/social/MessagesPanel.tsx": "React component for direct messaging: search and select users, view message threads, and send messages with a two-column layout (conversations list and chat view).",
  "frontend/src/components/social/PartiesPanel.tsx": "Placeholder component displaying a 'coming soon' message for the party system feature where users will be able to create groups and join games together.",
  "frontend/src/hooks/useAccountSettings.ts": "React Query hooks for managing user account settings including display name, avatar, and visibility preferences with automatic cache invalidation.",
  "frontend/src/hooks/useActor.ts": "React Query hook that creates and manages the backend actor instance with authentication, automatically invalidating dependent queries when identity changes.",
  "frontend/src/hooks/useBuilder2D.ts": "Custom hook managing 2D builder state for shapes and decals with operations like add, select, update, delete, reorder, and z-index manipulation.",
  "frontend/src/hooks/useBuilder2DProps.ts": "Custom hook for saving, loading, deleting, exporting, and importing 2D builder props (collections of elements) to/from localStorage.",
  "frontend/src/hooks/useCurrentUser.ts": "Simple wrapper hook that extracts and returns current user authentication state from useSessionAuth.",
  "frontend/src/hooks/useExperiences.ts": "Provides React Query hooks for fetching and managing experiences (getAllExperiences, searchExperiences, getExperiencesByAuthor, getExperiencesByCategory, getTrendingExperiences) and mutations for creating and rating experiences (not yet implemented in backend).",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements Internet Identity authentication using @dfinity/auth-client, providing a React context and hook (useInternetIdentity) for login, logout, identity management, and authentication status tracking with delegation validation.",
  "frontend/src/hooks/useQueries.ts": "Consolidates React Query hooks for user profiles (getCallerUserProfile, saveCallerUserProfile) and experiences (getAllExperiences, getExperiencesByCategory, getTrendingExperiences, searchExperiences, getExperience, createExperience, rateExperience), with most mutations marked as not yet implemented in backend.",
  "frontend/src/hooks/useSessionAuth.ts": "Provides session-based authentication hooks with login, signup, and logout functionality using session tokens stored in localStorage; currently uses placeholder implementations as backend methods are not yet available.",
  "frontend/src/hooks/useSocialFollowing.ts": "Defines placeholder React Query hooks for creator following functionality (getFollowedCreators, followCreator, unfollowCreator, getFollowerCount, isFollowing) that are disabled until backend implementation is complete.",
  "frontend/src/hooks/useSocialFriends.ts": "Provides React Query hooks for friend management (getFriendsList, getPendingFriendRequests, sendFriendRequest, respondToFriendRequest, unfriend) with all backend methods marked as not yet implemented.",
  "frontend/src/hooks/useSocialMessages.ts": "Defines React Query hooks for direct messaging (getMessages, sendMessage) with a local Message type definition; backend methods are not yet implemented.",
  "frontend/src/hooks/useSocialParties.ts": "Provides a placeholder hook (useGetCurrentParty) for party/group system functionality that is disabled until backend implementation is available.",
  "frontend/src/hooks/useUserDiscovery.ts": "Defines a disabled useSearchUsers hook for user discovery functionality that awaits backend implementation of session-based user search.",
  "frontend/src/hooks/useUserProfile.ts": "Defines React Query hooks for user profile operations (get current user, get user by principal, sign up) that are currently disabled and return null, awaiting backend session authentication implementation.",
  "frontend/src/index.css": "Defines global CSS with Tailwind imports, custom CSS variables for theming (colors, spacing, borders), and base styles using the Outfit and Builder Sans font families.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query and Internet Identity providers, then renders the App component into the root DOM element.",
  "frontend/src/pages/AvatarShop.tsx": "Displays a placeholder avatar shop page with category cards (Clothing, Accessories, Premium Items, Animations) and a \"Coming Soon\" message indicating the shop is under development.",
  "frontend/src/pages/Create.tsx": "Landing page for creation tools with two main cards: one for creating games/experiences using a 2D builder, and another for creating UGC accessories, each navigating to their respective creation pages.",
  "frontend/src/pages/CreateGamesBuilder2D.tsx": "Full 2D game builder interface with a three-panel layout: left sidebar for shapes/decals/layers, center canvas for building, and right sidebar toggling between properties and props panels.",
  "frontend/src/pages/CreateUGCAccessories.tsx": "Placeholder page for UGC accessories creation displaying a \"Coming Soon\" message with a back button to return to the main Create page.",
  "frontend/src/pages/DiniBucks.tsx": "Virtual currency page showing user balance (if authenticated), login/signup prompts for unauthenticated users, and feature cards describing how to earn, spend, trade, and use premium Dini Bucks.",
  "frontend/src/pages/Discover.tsx": "Main discovery page for browsing and searching user-created experiences with category tabs (Adventure, Roleplay, Simulator), trending section, and a publish dialog for authenticated users.",
  "frontend/src/pages/ExperienceDetails.tsx": "Detailed view page for individual experiences showing metadata, creator info, play button, rating controls, and simulated gameplay state with in-game menu.",
  "frontend/src/pages/Groups.tsx": "Placeholder page for groups feature displaying an empty state with messaging about joining communities.",
  "frontend/src/pages/Home.tsx": "Landing page showing personalized welcome card for authenticated users, recommended experiences grid, and friend activity sidebar.",
  "frontend/src/pages/Inventory.tsx": "Placeholder page for user inventory displaying an empty state for items, accessories, and collectibles.",
  "frontend/src/pages/Login.tsx": "Login form page with username/password fields, error handling, and link to signup page using session authentication.",
  "frontend/src/pages/Profile.tsx": "User profile page wrapped in RequireProfile guard showing avatar, display name, username, and account information with edit/settings buttons.",
  "frontend/src/pages/Settings.tsx": "Settings page component that allows authenticated users to manage their profile (display name, avatar upload/deletion), account visibility, and password, with mutation hooks for updates and delete confirmation dialogs.",
  "frontend/src/pages/SignUp.tsx": "Sign-up page component with form validation for username, display name, and password fields, using the useSessionAuth hook to create new user accounts.",
  "frontend/src/pages/Social.tsx": "Social hub page with tabbed interface for Friends, Messages, Parties, and Following panels, requiring authentication to access.",
  "frontend/src/utils/formatError.ts": "Utility function that normalizes various error types (Error objects, strings, backend trap errors) into user-friendly English messages for display.",
  "frontend/src/utils/sessionToken.ts": "Utility functions for managing session tokens in localStorage with get, set, and clear operations.",
  "frontend/src/utils/urlParams.ts": "URL parameter utilities for extracting query parameters from both regular and hash-based routing, with sessionStorage persistence and cleanup functions.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom color schemes using OKLCH, container settings, font families (Builder Sans, Outfit), and animation keyframes for the UI.",
  "project_state.json": "Project state metadata tracking feature requests to update the welcome message with authenticated user's display name (AR-1) and replace header logo with uploaded image (completed feature)."
}