{
  "kind": "build_request",
  "title": "Add Roblox-style left sidebar navigation, Discover categories/trending, and enhanced experience play/details UI",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-10",
      "text": "Add a left-side navigation menu in the main app layout that is visible on desktop/tablet widths and contains links for: Profile, Inventory, Groups, and Settings.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "On the left side, there's a menu with your profile, inventory, groups, and settings."
        ]
      },
      "acceptanceCriteria": [
        "When visiting any route that uses the main AppLayout, a left sidebar is rendered on >= md breakpoints without breaking the existing top header.",
        "Sidebar includes clickable nav items labeled \"Profile\", \"Inventory\", \"Groups\", and \"Settings\" (English text).",
        "\"Profile\" navigates to the existing /profile route.",
        "The sidebar does not require editing any files under frontend/src/components/ui or other immutable paths."
      ]
    },
    {
      "id": "REQ-11",
      "text": "Create functional routes/pages for Inventory, Groups, and Settings and wire them into the router and the new left-side menu.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "On the left side, there's a menu with your profile, inventory, groups, and settings."
        ]
      },
      "acceptanceCriteria": [
        "New routes exist for Inventory, Groups, and Settings and can be navigated to from the left sidebar.",
        "Each page renders without errors and clearly indicates the section (e.g., page title \"Inventory\", \"Groups\", \"Settings\").",
        "All user-facing text is in English."
      ]
    },
    {
      "id": "REQ-12",
      "text": "Update the Discover page to support browsing trending games across categories, including at least: Adventure, Roleplay, and Simulator.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "The Discover page shows trending games across categories like Adventure, Roleplay, and Simulator."
        ]
      },
      "acceptanceCriteria": [
        "Discover page provides a visible category browsing UI (e.g., tabs/chips/filters) with categories including \"Adventure\", \"Roleplay\", and \"Simulator\".",
        "Discover page includes a \"Trending\" section that shows experiences, and switching category updates the visible set of experiences.",
        "Experiences can be associated with a category in persisted data (not only hardcoded client-side)."
      ]
    },
    {
      "id": "REQ-13",
      "text": "Extend the Experience data model to include category and basic public stats needed for the details page: player count and thumbs up/down counts, and provide backend methods to read/update these stats.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "When you click a game, you see a green Play button, game description, player count, and thumbs up/down ratings."
        ]
      },
      "acceptanceCriteria": [
        "Backend Experience type persists a category value and fields for player count and thumbs up/down counts (with sensible defaults for existing experiences).",
        "There is a backend update method to register a thumbs up/down action for an experience (authenticated users only) and return updated counts.",
        "There is a backend query method to retrieve experience details including these stats (or the existing getExperience returns the extended shape)."
      ]
    },
    {
      "id": "REQ-14",
      "text": "Update the experience publishing flow so creators can choose a category (Adventure/Roleplay/Simulator at minimum) when publishing an experience, and ensure it is stored and used by Discover category browsing.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "The Discover page shows trending games across categories like Adventure, Roleplay, and Simulator."
        ]
      },
      "acceptanceCriteria": [
        "Publish Experience dialog includes a required category input with options including \"Adventure\", \"Roleplay\", and \"Simulator\".",
        "Submitting a new experience stores the selected category in the backend.",
        "Discover category browsing uses the stored category to filter experiences."
      ]
    },
    {
      "id": "REQ-15",
      "text": "Enhance the Experience Details page to display: a prominent green \"Play\" button, the experience description, a player count display, and thumbs up/down rating controls with counts.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "When you click a game, you see a green Play button, game description, player count, and thumbs up/down ratings."
        ]
      },
      "acceptanceCriteria": [
        "Experience Details page shows a visually prominent green Play button (label \"Play\") when not currently playing.",
        "Experience Details page renders player count (e.g., \"Players: 0\") and thumbs up/down controls with counts sourced from persisted backend data.",
        "Clicking thumbs up/down updates the counts (and persists via backend) and updates the UI without a full page refresh.",
        "All user-facing text is in English."
      ]
    },
    {
      "id": "REQ-16",
      "text": "During the in-page play mode for an experience, display standard gameplay controls guidance: WASD to move, Space to jump, Mouse to control the camera, and allow per-experience customization of this controls text.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "During gameplay, typical controls include WASD for movement, spacebar to jump, and mouse for camera control, though each game can customize these."
        ]
      },
      "acceptanceCriteria": [
        "When play mode is active, the UI shows a \"Controls\" section listing: \"WASD: Move\", \"Space: Jump\", and \"Mouse: Camera\" (English).",
        "Each experience can optionally override/customize the controls guidance stored with that experience; if no custom controls exist, the standard defaults are shown.",
        "Controls guidance is persisted in the backend as part of the experience data (not only hardcoded UI)."
      ]
    },
    {
      "id": "REQ-17",
      "text": "Add an in-game menu UI during play mode with options to Leave, Reset Character, and Settings, accessible while the experience is in play mode.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "There's also an in-game menu with options to leave, reset character, or adjust settings."
        ]
      },
      "acceptanceCriteria": [
        "When play mode is active, an in-game menu can be opened that displays buttons labeled \"Leave\", \"Reset Character\", and \"Settings\" (English).",
        "\"Leave\" exits play mode and returns the user to the normal Experience Details view state.",
        "\"Reset Character\" performs a visible reset action in the simulated play mode (e.g., shows a confirmation/toast and resets simulated state).",
        "\"Settings\" opens a settings panel/modal within play mode (it can be basic/placeholder but must render and be interactable)."
      ]
    },
    {
      "id": "REQ-18",
      "text": "If upgrading persisted backend state is required due to Experience type changes, add a conditional backend migration that preserves existing users/experiences and backfills new Experience fields with defaults.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-4"
        ]
      },
      "acceptanceCriteria": [
        "Existing stored experiences remain accessible after deployment.",
        "Existing experiences receive default values for new fields (category, player count, thumbs up/down, controls guidance) without trapping.",
        "Migration is implemented only if needed per the project migration policy (conditional)."
      ]
    }
  ],
  "constraints": [
    "Use English for all user-facing text.",
    "Backend must remain a single Motoko actor with all logic in backend/main.mo; only add backend/migration.mo if required for state upgrades.",
    "Do not edit frontend immutable paths (including frontend/src/components/ui, frontend/src/hooks/useInternetIdentity.ts/tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx)."
  ],
  "nonGoals": [
    "Implementing real 3D gameplay, physics, or a full game runtime.",
    "Real-time player count updates (no WebSockets/real-time infrastructure).",
    "Complex social systems for groups, inventory item ownership, or settings persistence beyond basic placeholders unless explicitly required by the above requirements."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}