{
  "kind": "build_request",
  "title": "Add social features: friends, private messaging, parties, and creator following",
  "projectName": "DiniVerse Social",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Implement backend social graph features: friend requests (send, accept, decline/cancel), friends list, and friend request inbox/outbox, all scoped to authenticated users and keyed by Principal.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Add: Social features include friend requests, private messaging, party systems for joining games together, and the ability to follow favorite creators."
        ]
      },
      "acceptanceCriteria": [
        "An authenticated user can send a friend request to another existing user principal and cannot send a request to themselves.",
        "The recipient can list pending incoming friend requests and accept or decline them.",
        "The sender can list pending outgoing friend requests and cancel them.",
        "When a friend request is accepted, both users appear in each other’s friends list.",
        "Unauthorized callers (not having #user permission) cannot use friend-request or friends APIs."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Implement backend private messaging: direct message threads between two Principals with APIs to create/find a conversation, send messages, list conversations, and fetch messages for a conversation.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Add: Social features include friend requests, private messaging, party systems for joining games together, and the ability to follow favorite creators."
        ]
      },
      "acceptanceCriteria": [
        "An authenticated user can send a message to another existing user principal.",
        "A user can list their conversations (at least one entry after sending/receiving a message).",
        "A user can fetch messages for a conversation and sees messages ordered oldest-to-newest.",
        "Only the two participants in a conversation can read its messages."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Implement backend party system: create party, invite users, accept/decline invites, join/leave party, list current party state for the caller, and optionally associate a party with an experienceId to support “joining games together”.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Add: Social features include friend requests, private messaging, party systems for joining games together, and the ability to follow favorite creators."
        ]
      },
      "acceptanceCriteria": [
        "An authenticated user can create a party and becomes the leader.",
        "A party leader can invite another user principal; invitees can list their pending party invites.",
        "An invitee can accept an invite and becomes a member of the party; they can also decline.",
        "Any member can leave the party; if the leader leaves, leadership is reassigned or the party is dissolved (documented behavior).",
        "A party can store an optional experienceId; members can fetch the party state and see that value."
      ]
    },
    {
      "id": "REQ-4",
      "text": "Implement backend creator following: allow authenticated users to follow and unfollow another Principal, list followed creators for the caller, and list follower count for a given creator principal.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Add: Social features include friend requests, private messaging, party systems for joining games together, and the ability to follow favorite creators."
        ]
      },
      "acceptanceCriteria": [
        "An authenticated user can follow and unfollow another principal and cannot follow themselves.",
        "The caller can list all creators they currently follow.",
        "For any principal, the backend can return follower count (0 if none).",
        "Follow state is reflected consistently after follow/unfollow without requiring a page refresh (frontend invalidates queries)."
      ]
    },
    {
      "id": "REQ-5",
      "text": "Add backend user discovery endpoints needed for social features: list/search user profiles by display name (returning principals + public profile fields) so users can find people to friend/message/follow.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Add: Social features include friend requests, private messaging, party systems for joining games together, and the ability to follow favorite creators."
        ]
      },
      "acceptanceCriteria": [
        "There is a query method to search users by a text term (case-insensitive) and return a bounded list of results.",
        "Search results include the user principal and displayName (and avatar reference if available).",
        "Unauthenticated users may use discovery only if explicitly intended; otherwise discovery requires #user permission (choose and apply consistently across endpoints)."
      ]
    },
    {
      "id": "REQ-6",
      "text": "Add a Social area in the frontend with navigation entry and routes/pages to manage: Friends (requests + friends list), Messages (inbox/conversations + thread view + compose), Parties (current party + invites), and Following (followed creators list).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Add: Social features include friend requests, private messaging, party systems for joining games together, and the ability to follow favorite creators."
        ]
      },
      "acceptanceCriteria": [
        "Left sidebar includes a new “Social” (or equivalent) navigation link that routes to the social hub.",
        "Social hub renders four sections/tabs: Friends, Messages, Parties, Following.",
        "Each section supports empty states and loading states using existing UI patterns (cards, skeletons, muted text).",
        "All actions that require authentication are blocked with clear English messaging and a navigation path to Sign Up / Log In."
      ]
    },
    {
      "id": "REQ-7",
      "text": "Create new React Query hooks for social APIs (friends, messages, parties, following, user search) using the existing actor pattern and query invalidation conventions already used by experiences and profiles.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Add: Social features include friend requests, private messaging, party systems for joining games together, and the ability to follow favorite creators."
        ]
      },
      "acceptanceCriteria": [
        "Hooks exist for: searching users, sending/responding to friend requests, listing friends, sending/fetching messages, party create/invite/respond/leave, follow/unfollow and listing followed creators.",
        "Mutations invalidate the appropriate cached queries so the UI updates after actions without a manual refresh.",
        "Hooks do not require edits to immutable hook files; they are implemented as new hook modules or modifications to non-immutable files only."
      ]
    },
    {
      "id": "REQ-8",
      "text": "Add “Follow creator” UI on the Experience Details page for the experience author, reflecting current follow state and follower count when available.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Add: Social features include friend requests, private messaging, party systems for joining games together, and the ability to follow favorite creators."
        ]
      },
      "acceptanceCriteria": [
        "When viewing an experience, the Creator card shows a Follow/Unfollow button for the author (hidden/disabled when not authenticated).",
        "Toggling follow updates the button state and follower count (if displayed) after the request completes.",
        "The UI prevents following yourself when the experience author equals the current user principal."
      ]
    },
    {
      "id": "REQ-9",
      "text": "Apply a coherent, consistent visual theme for the new social pages that matches the existing Tailwind/shadcn design system (typography, spacing, card layouts, and icon usage), without introducing new product features beyond the requested social functionality.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ]
      },
      "acceptanceCriteria": [
        "All new social screens use consistent layout primitives (container width, card styling, headings) aligned with existing pages like Home/Groups.",
        "User-facing text is English and uses the same tone as existing pages (clear, minimal, “Coming soon” only when truly not implemented)."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single Motoko actor in backend/main.mo; do not introduce additional backend services/canisters.",
    "Do not edit frontend paths marked immutable in SYSTEM_CONTEXT (e.g., frontend/src/hooks/useInternetIdentity.ts(x), frontend/src/hooks/useActor.ts, frontend/src/main.tsx, frontend/src/components/ui/*). Compose existing UI components instead.",
    "No real-time transport (no WebSockets/push). Social updates should work via queries/refetching.",
    "Use English for all user-facing text."
  ],
  "nonGoals": [
    "Group/community system beyond the requested party system (the existing Groups page can remain a placeholder unless needed for navigation).",
    "End-to-end encryption or advanced moderation/reporting tools for messaging.",
    "Third-party integrations for chat/social graphs outside the Internet Computer canister.",
    "Cross-device push notifications or email notifications for friend requests/messages."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}