{
  "kind": "build_request",
  "title": "Add first-party on-platform authentication (no external redirects)",
  "projectName": "Dini Verse",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Implement first-party (on-platform) authentication in the Motoko backend using username/password signup and login, without relying on Internet Identity or any external authentication redirects.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "add on-platform authentication"
        ]
      },
      "acceptanceCriteria": [
        "Backend exposes explicit canister methods for signup and login using username/password (no Internet Identity required).",
        "Passwords are not stored in plaintext (store a derived/hashed representation).",
        "Usernames are unique and attempts to re-register an existing username return a clear error.",
        "The authentication flow does not depend on caller being an authenticated principal (works for anonymous visitors)."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Add backend session management so authenticated users can remain logged in across page reloads using an on-platform session token, and enforce authorization for write actions based on a valid session.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "add on-platform authentication"
        ]
      },
      "acceptanceCriteria": [
        "Backend issues a session token on successful login and can validate it on subsequent calls.",
        "Backend provides a logout method that invalidates the active session token.",
        "Write actions that currently require #user permission (e.g., createExperience, saveCallerUserProfile, social/messaging mutations) are gated by a valid session token instead of Internet Identity-based caller permissions.",
        "Read-only queries (e.g., browsing experiences and viewing profiles) continue to work for guests without trapping with Unauthorized errors."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Update the frontend authentication UI to provide on-platform Login and Sign Up experiences (forms within the app) and remove the current 'Login Disabled'/'Sign Up Disabled' experience for normal usage.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "add on-platform authentication"
        ]
      },
      "acceptanceCriteria": [
        "/login renders an on-platform login form (username + password) and submits to the backend authentication API.",
        "/signup renders an on-platform signup form (at minimum: username, display name, password) and submits to the backend authentication API.",
        "After successful login/signup, the user is treated as authenticated in the UI and can access account-gated areas without seeing 'Accounts disabled' notices.",
        "User-facing validation and error messages are in English."
      ]
    },
    {
      "id": "REQ-4",
      "text": "Refactor the frontend auth state management to use the new on-platform session auth (instead of Internet Identity) while avoiding edits to immutable provider/hook files.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "add on-platform authentication"
        ]
      },
      "acceptanceCriteria": [
        "Frontend session state persists across reloads (e.g., via localStorage) using the backend session token.",
        "AuthButtons shows appropriate actions when signed out (e.g., Login / Sign Up) and Logout when signed in.",
        "RequireProfile no longer shows AccountsDisabledNotice for signed-out users; instead it should prompt users to log in (or redirect to /login) based on the new on-platform auth state.",
        "No changes are made to immutable paths (e.g., frontend/src/hooks/useInternetIdentity.ts(x), frontend/src/hooks/useActor.ts, frontend/src/main.tsx, frontend/src/components/ui/*)."
      ]
    },
    {
      "id": "REQ-5",
      "text": "Update the existing change-control/auth banner messaging to remain accurate after enabling on-platform authentication (i.e., reflect that authentication is on-platform and still avoids external redirects).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "add on-platform authentication"
        ]
      },
      "acceptanceCriteria": [
        "The banner continues to clearly state that external login redirects are disabled.",
        "The banner text no longer implies that authentication is disabled if on-platform authentication is now enabled.",
        "All banner/user-facing text is in English."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single Motoko actor in backend/main.mo; do not introduce multiple backend services.",
    "Do not add or depend on third-party authentication providers (including Internet Identity) or any off-platform authentication redirects.",
    "Do not edit frontend immutable paths: frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, and anything under frontend/src/components/ui."
  ],
  "nonGoals": [
    "Implementing OAuth/social login (Google, GitHub, etc.).",
    "Adding external databases or non-IC storage services for authentication data.",
    "Adding real-time auth synchronization (e.g., websockets) across tabs/devices."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}