{
  "kind": "build_request",
  "title": "Fix Settings page load failure by removing auth trap and improving error reporting",
  "projectName": "Dini Verse",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Update the backend settings retrieval API so that calling getOrCreateCallerSettings() never fails solely due to missing access-control permissions or missing prior settings initialization; it must always return a valid UserSettings record for the caller (creating and persisting defaults when needed).",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-5"
        ],
        "quotes": [
          "no, the settings page doesn't behave any better, it says the same error \"Failed to load settings. Please try again later.\" redeploy it"
        ]
      },
      "acceptanceCriteria": [
        "Calling getOrCreateCallerSettings() from the frontend no longer results in an authorization trap for typical usage (including first-time users).",
        "If the caller has no stored settings, default settings are created and persisted, and a non-null UserSettings is returned.",
        "Settings page no longer shows the generic load-failure alert due to backend trapping in getOrCreateCallerSettings()."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Ensure backend settings mutation methods (updateDisplayName, updateDisplayNameAndAvatar, updateVisibility, deleteAvatar) cannot fail solely because settings were not previously initialized; each method must reuse the same “get or initialize defaults” flow before applying updates.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-5"
        ],
        "quotes": [
          "no, the settings page doesn't behave any better, it says the same error \"Failed to load settings. Please try again later.\" redeploy it"
        ]
      },
      "acceptanceCriteria": [
        "A first-time user can successfully call updateDisplayName, updateDisplayNameAndAvatar, updateVisibility, and deleteAvatar without encountering a \"settings not found\"-style trap.",
        "After each mutation, subsequent calls to getOrCreateCallerSettings() reflect the updated values."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Improve Settings page error reporting so that when fetching settings fails, the UI includes the actual error message (in English) in addition to the existing generic text, to make deployment regressions diagnosable.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-5"
        ],
        "quotes": [
          "it says the same error \"Failed to load settings. Please try again later.\""
        ]
      },
      "acceptanceCriteria": [
        "When settings fetch fails, the Settings page still shows the existing text \"Failed to load settings. Please try again later.\" but also renders the underlying error message (e.g., from the thrown Error) in the same alert.",
        "The settings fetch hook continues to avoid infinite retries (retry remains disabled unless explicitly changed for a clear reason)."
      ]
    },
    {
      "id": "REQ-4",
      "text": "Redeploy a new production build that includes the backend settings fix and the improved frontend error reporting.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-5"
        ],
        "quotes": [
          "redeploy it"
        ]
      },
      "acceptanceCriteria": [
        "A new deployed version is produced that includes the changes from REQ-1 through REQ-3.",
        "After deployment, an authenticated user can open /settings and see settings data instead of the load-failure alert."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single Motoko actor in backend/main.mo; only introduce migration.mo if existing stable state schema changes require it.",
    "Do not edit files under frontend/src/components/ui or any frontend immutablePaths listed in SYSTEM_CONTEXT."
  ],
  "nonGoals": [
    "Implementing real username/password authentication or session validation (current useSessionAuth flow may remain placeholder).",
    "Adding new settings fields or redesigning the Settings page UI beyond error-message visibility needed for debugging."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}