{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "DiniVerse Social — Frontend social hub, hooks, and creator following UI",
  "requirements": [
    {
      "id": "REQ-6",
      "summary": "Add a Social area with sidebar navigation and a hub page containing Friends, Messages, Parties, and Following sections with auth-aware empty/loading states.",
      "acceptanceCriteria": [
        "Left sidebar includes a new “Social” (or equivalent) navigation link that routes to the social hub.",
        "Social hub renders four sections/tabs: Friends, Messages, Parties, Following.",
        "Each section supports empty states and loading states using existing UI patterns (cards, skeletons, muted text).",
        "All actions that require authentication are blocked with clear English messaging and a navigation path to Sign Up / Log In."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/layout/LeftSidebar.tsx",
          "operation": "modify",
          "description": "Add a new \"Social\" navigation item (with an appropriate lucide icon) linking to the new social hub route. Ensure styling matches existing sidebar items."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Register a new route (e.g., /social) that renders the Social hub page, ensuring it is reachable via navigation and consistent with the existing TanStack Router setup."
        },
        {
          "path": "frontend/src/pages/Social.tsx",
          "operation": "create",
          "description": "Implement the Social hub page with four sections/tabs (Friends, Messages, Parties, Following) using existing shadcn/tailwind layout primitives (Card, headings, muted text). Gate authenticated actions using the existing authorization flow (Internet Identity + role/profile patterns) with clear English prompts that direct users to Log in or Sign up. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/social/FriendsPanel.tsx",
          "operation": "create",
          "description": "Create the Friends tab content: user search (to find users by display name), pending requests, and friends list with actions (send request, accept/decline, cancel/unfriend) wired to React Query hooks. Include loading and empty states consistent with existing cards/skeleton patterns. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/social/MessagesPanel.tsx",
          "operation": "create",
          "description": "Create the Messages tab content: a simple conversation selector and a thread view, plus a compose form that lets users choose a recipient (via user search) and send a message. Provide clear empty/loading states and auth-required messaging. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/social/PartiesPanel.tsx",
          "operation": "create",
          "description": "Create the Parties tab content: current party state and invites list with actions (create party, invite, accept/decline invite, leave). Until backend capabilities are available, show appropriate disabled/empty states without adding non-requested features. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/social/FollowingPanel.tsx",
          "operation": "create",
          "description": "Create the Following tab content: list followed creators and allow unfollow actions. Include loading/empty states and clear auth-required messaging. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-7",
      "summary": "Add React Query hooks for social features (friends, messages, parties, following, and user search) using the existing actor pattern and query invalidation conventions.",
      "acceptanceCriteria": [
        "Hooks exist for: searching users, sending/responding to friend requests, listing friends, sending/fetching messages, party create/invite/respond/leave, follow/unfollow and listing followed creators.",
        "Mutations invalidate the appropriate cached queries so the UI updates after actions without a manual refresh.",
        "Hooks do not require edits to immutable hook files; they are implemented as new hook modules or modifications to non-immutable files only."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useSocialFriends.ts",
          "operation": "create",
          "description": "Create React Query hooks for friend workflows (list friends, list incoming/outgoing pending requests as supported, send request, respond accept/decline, cancel/unfriend) using the existing actor pattern from useActor and invalidating relevant query keys after mutations. Use the authorization component’s frontend guidance for handling auth state and authorization failures gracefully. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/hooks/useSocialMessages.ts",
          "operation": "create",
          "description": "Create React Query hooks for messaging workflows (list conversations if available, fetch thread/messages, send message) using the actor pattern and invalidate/refetch message-related queries after sending. Handle authorization failures with clear English UI messaging. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/hooks/useSocialParties.ts",
          "operation": "create",
          "description": "Create React Query hooks for party workflows (get current party, create party, invite, accept/decline invite, leave) using the actor pattern and invalidate party-related query keys after mutations. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/hooks/useSocialFollowing.ts",
          "operation": "create",
          "description": "Create React Query hooks for creator following workflows (get followed creators, follow, unfollow, follower count where supported) using the actor pattern and invalidate follow-related query keys after mutations so the UI updates without refresh. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/hooks/useUserDiscovery.ts",
          "operation": "create",
          "description": "Create a React Query hook for user discovery/search (search users by display name) backed by the existing actor pattern; ensure it can be used by Friends and Messages compose flows and returns principals + public profile fields (including avatar reference when present). Use blob-storage ExternalBlob direct URL display patterns for avatars. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-8",
      "summary": "Add Follow/Unfollow creator UI on Experience Details for the experience author, reflecting follow state and follower count when available.",
      "acceptanceCriteria": [
        "When viewing an experience, the Creator card shows a Follow/Unfollow button for the author (hidden/disabled when not authenticated).",
        "Toggling follow updates the button state and follower count (if displayed) after the request completes.",
        "The UI prevents following yourself when the experience author equals the current user principal."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/ExperienceDetails.tsx",
          "operation": "modify",
          "description": "Enhance the Creator card to include a Follow/Unfollow control and follower count display (when available) for the experience author. Use the new following hooks for state/mutations, disable or hide the action when unauthenticated, and prevent self-follow by comparing the author principal to the current identity principal (authorization component guidance). Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/experiences/CreatorFollowButton.tsx",
          "operation": "create",
          "description": "Add a small reusable UI component for Follow/Unfollow that accepts an author principal and renders the correct state (followed/unfollowed, pending) plus optional follower count. Reuse existing shadcn Button/Card typography and show clear English auth-required messaging when disabled. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-9",
      "summary": "Apply consistent Tailwind/shadcn visual styling across the new Social UI to match existing app layout and tone.",
      "acceptanceCriteria": [
        "All new social screens use consistent layout primitives (container width, card styling, headings) aligned with existing pages like Home/Groups.",
        "User-facing text is English and uses the same tone as existing pages (clear, minimal, “Coming soon” only when truly not implemented)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/Social.tsx",
          "operation": "modify",
          "description": "Refine Social hub layout to match existing page patterns (e.g., container spacing, H1/H2 hierarchy, Card sections, muted helper text), ensuring consistent typography and spacing with pages like Groups/Home. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/social/FriendsPanel.tsx",
          "operation": "modify",
          "description": "Align Friends panel UI with existing shadcn patterns (Card sections, Button variants, muted text, loading placeholders) and ensure all user-facing text is clear English. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/social/MessagesPanel.tsx",
          "operation": "modify",
          "description": "Align Messages panel UI with existing patterns (thread layout, empty/loading states, form controls) and ensure clear English copy with minimal placeholders. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/social/PartiesPanel.tsx",
          "operation": "modify",
          "description": "Align Parties panel UI with existing patterns and ensure any unimplemented backend-dependent actions are presented as disabled with clear English explanation (avoid adding new product features). Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/social/FollowingPanel.tsx",
          "operation": "modify",
          "description": "Align Following panel UI with existing patterns and ensure consistent English text and empty/loading states. Verify the component's usage instructions before implementing."
        }
      ]
    }
  ]
}